'''Напишите программу, которая найдёт произведение пар чисел списка.
Парой считаем первый и последний элемент, второй и предпоследний и т.д.
- [2, 3, 4, 5, 6] => [12, 15, 16];
- [2, 3, 5, 6] => [12, 15]'''
a = [2, 3, 4, 5, 6]
mul = 0
ans = []
for i in range(int(len(a)/2)):
    mul = a[0] * a[-1]
    ans.append(mul)
    a.pop(0)
    a.pop(-1)
if len(a) % 2 == 1:
    ans.append(a[0] * a[0])
print(ans)
