'''Задайте список из вещественных чисел. 
Напишите программу, которая найдёт разницу между максимальным и минимальным значением дробной части элементов.
- [1.1, 1.2, 3.1, 5, 10.01] => 0.19'''
a = [1.1, 1.2, 3.1, 5, 10.01]
for i in range(len(a)):
    a[i] = a[i] % 1
max = a[0]
min = a[0]
for i in range(len(a)):
    if a[i] > max:
        max = a[i]
    if a[i] < min and a[i] != 0:
        min = a[i]
print(round((max - min), 2))
